z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Adc_560x.c
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 * 
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with  
 * the terms contained in the written license agreement between you and ArcCore, 
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as 
 * published by the Free Software Foundation and appearing in the file 
 * LICENSE.GPL included in the packaging of this file or here 
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

/* In order to support multiple hw units we need to match group to a certain hw controller.
 * We handle this in a very simple way i.e. group 0-99 -> hwUnitId 0, group 100-199 -> hwUnitId 1 etc.*
 */

/** @reqSettings DEFAULT_SPECIFICATION_REVISION=4.1.2 */
/** @tagSettings DEFAULT_ARCHITECTURE=PPC|MPC5607B|MPC5645S */

/* ----------------------------[includes]------------------------------------*/

#include <assert.h>
#include <stdlib.h>
#include "Std_Types.h"
#include "mpc55xx.h"
#include "Mcu.h"
#include "Adc.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#include "Os.h"
#include "isr.h"
#include "irq.h"
#include "arc.h"
#include "Adc_Internal.h"
/* ----------------------------[private define]------------------------------*/


/* DMA support is only experimental for 5606 */
#define DONT_USE_DMA_IN_ADC_MPC560X

#if ( defined(CFG_MPC5606S) && !defined(DONT_USE_DMA_IN_ADC_MPC560X) )
	#define ADC_USES_DMA
	#include "Dma.h"
#endif

#if ( defined(ADC_USES_DMA) && !defined(USE_DMA) )
	#error Adc is configured to use Dma but the module is not enabled.
#endif


#if defined(CFG_MPC5668)
#define ADC0_EOC_INT 	ADC_A_EOC
#define ADC0_ER_INT 		ADC_A_ERR
#define	ADC0_WD_INT		ADC_A_WD
#define ADC1_EOC_INT 	ADC_B_EOC
#define ADC1_ER_INT 		ADC_B_ERR
#define	ADC1_WD_INT		ADC_B_WD
#endif

#if defined(CFG_MPC5668)
#define ADC_BASE_ADDRESS 0xFFF80000
#define GET_HW_CONTROLLER(_controller)  \
                            ((volatile struct ADC_tag *)(ADC_BASE_ADDRESS + 0x4000*(_controller)))
#elif defined(CFG_MPC5744P)
static volatile struct ADC_tag* const ADC_HW[] = {&ADC_0, &ADC_1, &ADC_2, &ADC_3};
#define GET_HW_CONTROLLER(_controller) ADC_HW[_controller]
#elif defined(CFG_MPC5777M)
#define ADC_tag SARADC_tag
static volatile struct ADC_tag* const ADC_HW[] = {&SARADC_0, &SARADC_1, &SARADC_2, &SARADC_3, &SARADC_4, &SARADC_5, &SARADC_6, &SARADC_7, &SARADC_8, &SARADC_9, &SARADC_10, &SARADC_B};
#define GET_HW_CONTROLLER(_controller) ADC_HW[_controller]
#else
#define ADC_BASE_ADDRESS 0xFFE00000UL
#define GET_HW_CONTROLLER(_controller)  \
                            ((volatile struct ADC_tag *)(ADC_BASE_ADDRESS + ((_controller)*0x00004000uL)))

#endif


#define GET_HWUNITID_FROM_GROUP(_group) (_group / ADC_NOF_GROUP_PER_CONTROLLER)

/* ----------------------------[private macro]-------------------------------*/
/* Development error macros. */
#if ( ADC_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(ADC_MODULE_ID,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(ADC_MODULE_ID,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif
/* ----------------------------[private typedef]-----------------------------*/
/* ----------------------------[private function prototypes]-----------------*/
#ifdef ADC_HWUNIT_ADC_CTRL_0_ENABLED
/**
 * Interrupt Service Routine for HW unit 0
 */
ISR(Group0ConversionComplete_ADC0);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_1_ENABLED
/**
 * Interrupt Service Routine for HW unit 1
 */
ISR(Group0ConversionComplete_ADC1);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_2_ENABLED
/**
 * Interrupt Service Routine for HW unit 2
 */
ISR(Group0ConversionComplete_ADC2);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_3_ENABLED
/**
 * Interrupt Service Routine for HW unit 3
 */
ISR(Group0ConversionComplete_ADC3);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_4_ENABLED
/**
 * Interrupt Service Routine for HW unit 4
 */
ISR(Group0ConversionComplete_ADC4);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_5_ENABLED
/**
 * Interrupt Service Routine for HW unit 5
 */
ISR(Group0ConversionComplete_ADC5);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_6_ENABLED
/**
 * Interrupt Service Routine for HW unit 6
 */
ISR(Group0ConversionComplete_ADC6);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_7_ENABLED
/**
 * Interrupt Service Routine for HW unit 7
 */
ISR(Group0ConversionComplete_ADC7);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_8_ENABLED
/**
 * Interrupt Service Routine for HW unit 8
 */
ISR(Group0ConversionComplete_ADC8);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_9_ENABLED
/**
 * Interrupt Service Routine for HW unit 9
 */
ISR(Group0ConversionComplete_ADC9);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_10_ENABLED
/**
 * Interrupt Service Routine for HW unit 10
 */
ISR(Group0ConversionComplete_ADC10);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_11_ENABLED
/**
 * Interrupt Service Routine for HW unit 11
 */
ISR(Group0ConversionComplete_ADC11);
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_B_ENABLED
/**
 * Interrupt Service Routine for HW unit B
 */
ISR(Group0ConversionComplete_ADCB);
#endif
/**
 * Interrupt Service Routine that all the others above use. This gets called when
 * an end of chain interrupt occurs.
 * @param unit Which HW unit
 */
void Group0ConversionComplete (uint32 unit);
/**
 * Sets the clock and powers up the ADC.
 * @param AdcConfigPtr  Pointer to the configuration to use.
 */
static void ConfigureADC (const Adc_ConfigType *AdcConfigPtr);
/**
 * Sets up the ISRs for ADC interrupts.
 */
static void ConfigureADCInterrupts (void);
/**
 * Called in interrupt context. Buffer pointers and sample counters are re-calculated here and
 * state is changed.
 *
 * @param group         Numeric ID of requested ADC Channel group.
 * @param AdcConfigPtr  Pointer to the configuration to use.
 * @param hwPtr         Pointer to a struct of ADC registers for this hw unit.
 */
void GroupConversionComplete (Adc_GroupType group, const Adc_ConfigType *AdcConfigPtr, volatile struct ADC_tag *hwPtr);
/* ----------------------------[private variables]---------------------------*/

