z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Adc_560x.c
/* static variable declarations */
static Adc_StateType adcState = ADC_STATE_UNINIT;
static const Adc_ConfigType *AdcGlobalConfigPtr;      /* Pointer to configuration structure. */

/* ----------------------------[private functions]---------------------------*/
/**
 * Gets the configuration pointer for the supplied HW unit.
 * @param unit Which HW unit
 * @return Pointer to the Adc_Config for this HW unit.
 */
static const Adc_ConfigType * GetControllerConfigPtrFromHwUnitId(uint32 unit)
{
	const Adc_ConfigType *AdcConfigPtr = NULL;

	if(adcState == ADC_STATE_INIT){
		for (uint32 configId = 0; configId < ADC_ARC_CTRL_CONFIG_CNT; configId++) {
			if(unit == AdcGlobalConfigPtr[configId].hwConfigPtr->hwUnitId){
				AdcConfigPtr = &AdcGlobalConfigPtr[configId];
				break;
			}
		}
	}

	return AdcConfigPtr;
}

/**
 * Gets the configuration pointer for the HW unit for the supplied group
 * @param group Numeric ID of requested ADC Channel group
 * @return Pointer to the Adc_Config for this channel group
 */
static const Adc_ConfigType * GetControllerConfigPtrFromGroupId(Adc_GroupType group)
{
	return GetControllerConfigPtrFromHwUnitId(GET_HWUNITID_FROM_GROUP(group)); /*lint !e632 uint32 = Adc_GroupType = uint32 */
}

/* ----------------------------[public functions]----------------------------*/

/* @req SWS_Adc_00228 */
#if (ADC_DEINIT_API == STD_ON)
void Adc_DeInit (void)
{
    volatile struct ADC_tag *hwPtr;
    boolean okToClear = TRUE;

    for (uint32 configId = 0; configId < ADC_ARC_CTRL_CONFIG_CNT; configId++) {
        const Adc_ConfigType *AdcConfigPtr = &AdcGlobalConfigPtr[configId];

        if (E_OK == Adc_CheckDeInit(adcState, AdcConfigPtr))
        {
            /* @req SWS_Adc_00110 */
            /*lint -e{9033} -e{923} Addressing memory mapped register so cast from integer to pointer ok */
            hwPtr = GET_HW_CONTROLLER(AdcGlobalConfigPtr[configId].hwConfigPtr->hwUnitId);
            for(Adc_GroupType group = 0; group < AdcConfigPtr->nbrOfGroups; group++)
            {
                /* Set group status to idle. */
                AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
            }

            /* Disable DMA transfer*/

#ifdef ADC_USES_DMA
#ifndef CFG_MPC5604B
            hwPtr->DMAE.B.DMAEN = 0;
#endif
#endif
            /* Power down ADC */
            hwPtr->MCR.R = 0x0001;

            /* Disable all interrupt*/
            /* @req SWS_Adc_00111 */
            hwPtr->IMR.R = 0;
        }
        else
        {
            /* Not ok to change adcState if any unit is running */
            okToClear = FALSE;
        }
    }

    if(okToClear)
    {
        /* Clean internal status. */
        AdcGlobalConfigPtr = (Adc_ConfigType *)NULL;
        adcState = ADC_STATE_UNINIT;
    }
}
#endif

/* @req SWS_Adc_00056  */
/* @req SWS_Adc_00246  Module implementing function, writes the register.*/
/* @req SWS_Adc_00247  PORT should init register if reg is I/O and affetcs several modules*/
/* @req SWS_Adc_00248  MCU shold init register if not I/O but affects several modules*/
/* @req SWS_Adc_00249  One time writable registers that require init directly after reset should be inited by startup code*/
/* @req SWS_Adc_00250  All other registers shall be initialized by the startup code*/
void Adc_Init (const Adc_ConfigType *ConfigPtr)
{
    if ( E_OK == Adc_CheckInit(adcState, ConfigPtr) )
    {
        /* First of all, store the location of the global configuration data. */
        AdcGlobalConfigPtr = ConfigPtr;

        for (uint32 configId = 0; configId < ADC_ARC_CTRL_CONFIG_CNT; configId++)
        {
            const Adc_ConfigType *AdcConfigPtr = &AdcGlobalConfigPtr[configId];

            for (Adc_GroupType group = 0; group < AdcConfigPtr->nbrOfGroups; group++)
            {
                /* @req  SWS_Adc_00307 */
                AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
                /* @req SWS_Adc_00077 */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
                AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 0;
#endif
            }

            /* Enable ADC. */
            ConfigureADC(AdcConfigPtr);
        }

        ConfigureADCInterrupts();

        /* Move on to INIT state. */
        adcState = ADC_STATE_INIT;
    }
}

Std_ReturnType Adc_SetupResultBuffer (Adc_GroupType group, Adc_ValueGroupType *DataBufferPtr)
{
  Std_ReturnType returnValue = E_NOT_OK;

  const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromGroupId(group);

  /* Check for development errors. */
  if (E_OK == Adc_CheckSetupResultBuffer (adcState, AdcConfigPtr, group ,DataBufferPtr))
  {
      /* @req SWS_Adc_00420 */
    AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER].status->resultBufferPtr = DataBufferPtr;
    
    returnValue = E_OK;
  }

  return (returnValue);
}

Adc_StreamNumSampleType Adc_GetStreamLastPointer(Adc_GroupType group, Adc_ValueGroupType** PtrToSamplePtr)
{
    /* @req SWS_Adc_00382  */
    /* @req SWS_Adc_00221 */
    /* @req SWS_Adc_00222 */
    const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromGroupId(group);
    Adc_StreamNumSampleType nofSample = 0;
    *PtrToSamplePtr = NULL;

    /* Check for development errors. */
    if (E_OK == Adc_CheckGetStreamLastPointer (adcState, AdcConfigPtr, group))
    {
        const Adc_GroupDefType *groupPtr = &AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER];

        /* Set resultPtr to application buffer. */
        if(groupPtr->status->currSampleCount > 0){
            /* @req SWS_Adc_00214 */
            /* @req SWS_Adc_00219 */
            /* @req SWS_Adc_00387 */
            *PtrToSamplePtr = &groupPtr->status->currResultBufPtr[0];
            nofSample = groupPtr->status->currSampleCount;
        }

        if( (ADC_COMPLETED  == groupPtr->status->groupStatus) ){
            /* @req SWS_Adc_00328 */
            groupPtr->status->groupStatus = ADC_BUSY;
        }
        else if( ADC_STREAM_COMPLETED  == groupPtr->status->groupStatus )
        {
            if( (ADC_CONV_MODE_ONESHOT == groupPtr->conversionMode) &&
                    (ADC_TRIGG_SRC_SW == groupPtr->triggerSrc) &&
                    (ADC_ACCESS_MODE_SINGLE == groupPtr->accessMode)) {
                /* @req SWS_Adc_00327 */
                groupPtr->status->groupStatus = ADC_IDLE;
            }
            else if( (ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode) &&
                    (ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode) ){
                /* @req SWS_Adc_00327 */
                groupPtr->status->groupStatus = ADC_IDLE;
            }
            else if( ADC_CONV_MODE_CONTINUOUS == groupPtr->conversionMode ){
                /* @req SWS_Adc_00326 */
                groupPtr->status->groupStatus = ADC_BUSY;
            }
            else
            {
                /* MISRA */
            }
        }
        else
        {
            /* MISRA */
        }
    }
    else
    {
        /* MISRA */
    }

