z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Adc_560x.c
    return nofSample;

}

#if (ADC_READ_GROUP_API == STD_ON)
Std_ReturnType Adc_ReadGroup (Adc_GroupType group, Adc_ValueGroupType *dataBufferPtr)
{
    /* @req SWS_Adc_00383  */
    /* @req SWS_Adc_00221 */
    /* @req SWS_Adc_00222 */
    Std_ReturnType returnValue = E_NOT_OK;
    Adc_ChannelType channel;
    Adc_ValueGroupType const *tmpPointer;
    const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromGroupId(group);

    if ( (E_OK == Adc_CheckReadGroup (adcState, AdcConfigPtr, group)) && (dataBufferPtr != NULL) )
    {
        const Adc_GroupDefType *groupPtr = &AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER];

        returnValue = E_OK;

        if ((ADC_CONV_MODE_ONESHOT == groupPtr->conversionMode) &&
                (ADC_STREAM_COMPLETED  == groupPtr->status->groupStatus))
        {
            /** @req SWS_Adc_00330. */
            groupPtr->status->groupStatus = ADC_IDLE;
        }
        else if ((ADC_CONV_MODE_CONTINUOUS == groupPtr->conversionMode) &&
                (ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode) &&
                (ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode) &&
                (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
        {
            /** @req SWS_Adc_00330. */
            groupPtr->status->groupStatus = ADC_IDLE;
        }
        else if ((ADC_CONV_MODE_CONTINUOUS == groupPtr->conversionMode) &&
                (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
        {
            /** @req SWS_Adc_00329 */
            groupPtr->status->groupStatus = ADC_BUSY;
        }
        else if (ADC_COMPLETED    == groupPtr->status->groupStatus)
        {
            /* @req SWS_Adc_00331. */
            groupPtr->status->groupStatus = ADC_BUSY;
        }
        else{/* MISRA */}
        /* Copy the result to application buffer. */
        for (channel = 0; channel < groupPtr->numberOfChannels; channel++)
        {
            if(groupPtr->status->currSampleCount > 0){
                /* Remeber that the result buffer has the following layout: CH1_SMPL1, CH1_SMPL2, CH2_SMPL1, CH2_SMPL2 */
                /* @req SWS_Adc_00075 */
                tmpPointer = groupPtr->status->currResultBufPtr;
                if( ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode )
                {
                    if( ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode ){
                        tmpPointer--;
                    }
                    else if( ADC_STREAM_BUFFER_CIRCULAR == groupPtr->streamBufferMode ){
                        /* Handle buffer wrapping */
                        if( tmpPointer > groupPtr->status->resultBufferPtr ){ /*lint !e946 Both pointers pointing to same memory object*/
                            tmpPointer--;
                        }
                        else{
                            tmpPointer = &(groupPtr->status->resultBufferPtr[groupPtr->streamNumSamples-1]);
                        }
                    }
                    else{
                        /*MISRA*/
                    }
                }
                dataBufferPtr[channel] = tmpPointer[channel*groupPtr->streamNumSamples];
            }else{
                /* @req SWS_Adc_00075 */
                dataBufferPtr[channel] = groupPtr->status->resultBufferPtr[channel];
            }
        }
    }

    return (returnValue);
}
#endif

void GroupConversionComplete (Adc_GroupType group, const Adc_ConfigType *AdcConfigPtr, volatile struct ADC_tag *hwPtr)
{
    const Adc_GroupDefType *adcGroup = &AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER];

    if(ADC_ACCESS_MODE_SINGLE == adcGroup->accessMode )
    {
        /* @req SWS_Adc_00387 */
        adcGroup->status->currSampleCount = 1;

        /* @req SWS_Adc_00325 */
        adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;

        if( adcGroup->conversionMode == ADC_CONV_MODE_CONTINUOUS )
        {
            /* Turn on the end of chain interrupt again */            
            hwPtr->IMR.B.MSKECH = 1;	        
        }
        else
        {            
            /* Stop sampling */
            hwPtr->MCR.B.NSTART=0;
        }
    }
    else
    {
        if(ADC_STREAM_BUFFER_LINEAR == adcGroup->streamBufferMode)
        {
            adcGroup->status->currResultBufPtr++;

            adcGroup->status->currSampleCount++;
            if(adcGroup->status->currSampleCount < adcGroup->streamNumSamples)
            {
                /* @req SWS_Adc_00224 */
                adcGroup->status->groupStatus = ADC_COMPLETED;

#if defined (ADC_USES_DMA)
                /* Increase current result buffer ptr */
                Dma_ConfigureDestinationAddress((uint32_t)adcGroup->status->currResultBufPtr, adcGroup->dmaResultChannel);
#endif

                hwPtr->IMR.B.MSKECH = 1;
            }
            else
            {
                /* All sample completed. */
                /* @req SWS_Adc_00325 */
                adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;

                /* Stop sampling */
                hwPtr->MCR.B.NSTART=0;
            }
        }
        else if(ADC_STREAM_BUFFER_CIRCULAR == adcGroup->streamBufferMode)
        {
            adcGroup->status->currResultBufPtr++;
            /* Check for buffer wrapping */
            if( adcGroup->status->currResultBufPtr >= &(adcGroup->status->resultBufferPtr[adcGroup->streamNumSamples]) ){/*lint !e946 Both pointers pointing to same memory object*/
                adcGroup->status->currResultBufPtr = adcGroup->status->resultBufferPtr;
            }

            adcGroup->status->currSampleCount++;
            if(adcGroup->status->currSampleCount < adcGroup->streamNumSamples)
            {
                /* @req SWS_Adc_00224 */
                adcGroup->status->groupStatus = ADC_COMPLETED;
            }
            else{
                adcGroup->status->currSampleCount = adcGroup->streamNumSamples;
                /* All samples completed */
                /* @req SWS_Adc_00325 */
                adcGroup->status->groupStatus = ADC_STREAM_COMPLETED;
            }

