z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Adc_560x.c
#if defined (ADC_USES_DMA)
            /* Increase current result buffer ptr */
            Dma_ConfigureDestinationAddress((uint32_t)adcGroup->status->currResultBufPtr, adcGroup->dmaResultChannel);
#endif
            hwPtr->IMR.B.MSKECH = 1;            
        }
        else
        {
            //nothing to do.
        }
    }
    /* Call notification if enabled. */
    /* @req SWS_Adc_00060 */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* @req SWS_Adc_00083 */
    /* @req SWS_Adc_00080 */
    if ( (adcGroup->status->notifictionEnable>0) && (adcGroup->groupCallback != NULL) )
    {
        /* @req SWS_Adc_00082 */
        adcGroup->groupCallback();
    }
#endif
}

void Group0ConversionComplete (uint32 unit)
{
    /*lint -e{9033} -e{923} Addressing memory mapped register so cast from integer to pointer ok */
	volatile struct ADC_tag *hwPtr = GET_HW_CONTROLLER(unit);
	const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromHwUnitId(unit);

	/* Clear ECH Flag and disable interrupt */
	/* @req SWS_Adc_00078 */
	hwPtr->ISR_STATUS.B.ECH = 1;
	hwPtr->IMR.B.MSKECH = 0;

	// Check which group is busy, only one is allowed to be busy at a time in a hw unit
	for (uint32 group = 0; group < AdcConfigPtr->nbrOfGroups; group++)
	{
	  if(AdcConfigPtr->groupConfigPtr[group].status->groupStatus != ADC_IDLE)
	  {
#if !defined (ADC_USES_DMA)
		/* Copy to result buffer */
		for(Adc_ChannelType index=0; index < AdcConfigPtr->groupConfigPtr[group].numberOfChannels; index++)
		{
            /* To get the layout of the buffer right, first all samples from one channel,
            than all samples for the next etc.*/
		    Adc_ValueGroupType *resultBufPtr = &AdcConfigPtr->groupConfigPtr[group].status->currResultBufPtr[index*AdcConfigPtr->groupConfigPtr[group].streamNumSamples];
#if defined(CFG_MPC5606S) || defined(CFG_MPC5645S)
		    uint32 chDataRegIndex = AdcConfigPtr->groupConfigPtr[group].channelList[index];
#else
		    uint32 chDataRegIndex = AdcConfigPtr->groupConfigPtr[group].channelList[index];
#endif
		    *resultBufPtr = hwPtr->CDR[chDataRegIndex].B.CDATA; /*lint !e632 */
		}
#endif
	    GroupConversionComplete((Adc_GroupType)group, AdcConfigPtr, hwPtr);
		break;
	  }
	}
}

#ifdef ADC_HWUNIT_ADC_CTRL_0_ENABLED
ISR(Group0ConversionComplete_ADC0){
	Group0ConversionComplete(ADC_CTRL_0);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_1_ENABLED
ISR(Group0ConversionComplete_ADC1){
    Group0ConversionComplete(ADC_CTRL_1);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_2_ENABLED
ISR(Group0ConversionComplete_ADC2){
    Group0ConversionComplete(ADC_CTRL_2);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_3_ENABLED
ISR(Group0ConversionComplete_ADC3){
    Group0ConversionComplete(ADC_CTRL_3);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_4_ENABLED
ISR(Group0ConversionComplete_ADC4){
    Group0ConversionComplete(ADC_CTRL_4);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_5_ENABLED
ISR(Group0ConversionComplete_ADC5){
    Group0ConversionComplete(ADC_CTRL_5);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_6_ENABLED
ISR(Group0ConversionComplete_ADC6){
    Group0ConversionComplete(ADC_CTRL_6);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_7_ENABLED
ISR(Group0ConversionComplete_ADC7){
    Group0ConversionComplete(ADC_CTRL_7);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_8_ENABLED
ISR(Group0ConversionComplete_ADC8){
    Group0ConversionComplete(ADC_CTRL_8);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_9_ENABLED
ISR(Group0ConversionComplete_ADC9){
    Group0ConversionComplete(ADC_CTRL_9);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_10_ENABLED
ISR(Group0ConversionComplete_ADC10){
    Group0ConversionComplete(ADC_CTRL_10);
}
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_B_ENABLED
ISR(Group0ConversionComplete_ADCB){
    Group0ConversionComplete(ADC_CTRL_B);
}
#endif

static void  ConfigureADC (const Adc_ConfigType *AdcConfigPtr)
{
	/* NULL pointer check */
	if ( (AdcConfigPtr == NULL) || (AdcConfigPtr->hwConfigPtr == NULL) ){
		return;
	}

  /*lint -e{9033} -e{923} Addressing memory mapped register so cast from integer to pointer ok */
  volatile struct ADC_tag *hwPtr = GET_HW_CONTROLLER(AdcConfigPtr->hwConfigPtr->hwUnitId);

  /* Set ADC CLOCK */
#if !defined(CFG_MPC5777M)
  hwPtr->MCR.B.ADCLKSEL = AdcConfigPtr->hwConfigPtr->adcPrescale; /*lint !e632 vuint32_t = Adc_PrescaleType = uint32*/
#endif
#if !defined(CFG_MPC5744P) && !defined(CFG_MPC5643L) && !defined(CFG_SPC56XL70)
  hwPtr->DSDR.B.DSD = 254;
#endif
  /* Power on ADC */
  hwPtr->MCR.B.PWDN = 0;

#if defined(ADC_USES_DMA)
  /* Enable DMA. */
  hwPtr->DMAE.B.DMAEN = 1;
#endif
}

static void ConfigureADCInterrupts (void)
{
#ifdef ADC_HWUNIT_ADC_CTRL_0_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC0, ADC0_EOC_INT,     2, 0 ); /*lint !e717 !e641 We want the do ... while(FALSE) */
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_1_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC1, ADC1_EOC_INT,     2, 0 );/*lint !e717 !e641 We want the do ... while(FALSE) */
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_2_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC2, ADC2_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_3_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC3, ADC3_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_4_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC4, ADC4_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_5_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC5, ADC5_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_6_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC6, ADC6_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_7_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC7, ADC7_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_8_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC8, ADC8_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_9_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC9, ADC9_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_10_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC10, ADC10_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_11_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADC11, ADC11_EOC_INT,     2, 0 );
#endif
#ifdef ADC_HWUNIT_ADC_CTRL_B_ENABLED
    ISR_INSTALL_ISR2(  "Adc_Grp", Group0ConversionComplete_ADCB, ADCB_EOC_INT,     2, 0 );
#endif
}

/* @req SWS_Adc_00259 */
/* @req SWS_Adc_00260 */
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
 * Configures the conversion time using the configuration parameters supplied.
 *
 * @param hwPtr Pointer to ADC hardware struct
 * @param convTimePtr Pointer to configuration struct for the Conversion Time.
 */
static void setConversionTime(volatile struct ADC_tag *hwPtr, const Adc_Channel_Phase_DurationType *convTimePtr)
{
/*lint -save -e632 Register files from Freescale */
#if defined(CFG_MPC5643L) || defined(CFG_SPC56XL70)
    hwPtr->CTR0.B.INPLATCH = convTimePtr->INPLATCH;
    hwPtr->CTR0.B.INPCMP = convTimePtr->INPCMP;
    hwPtr->CTR0.B.INSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR1.B.INSAMP = convTimePtr->INPSAMP;
#elif defined(CFG_MPC5606S) || defined(CFG_MPC5645S)
    hwPtr->CTR[1].B.INPLATCH = convTimePtr->INPLATCH; /*lint !e632 vuint32_t = Adc_LatchTimeType = uint32 */
    hwPtr->CTR[1].B.INPCMP = convTimePtr->INPCMP; /*lint !e632 vuint32_t = Adc_CmpTimeType = uint32 */
    hwPtr->CTR[1].B.INPSAMP = convTimePtr->INPSAMP; /*lint !e632 vuint32_t = Adc_SampTimeType = uint32 */
#elif defined(CFG_MPC5744P)
    hwPtr->CTR[0].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[1].B.INPSAMP = convTimePtr->INPSAMP;
#elif defined(CFG_MPC5777M)
    hwPtr->CTR[0].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[1].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[2].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[3].B.INPSAMP = convTimePtr->INPSAMP;
#else
    hwPtr->CTR[0].B.INPLATCH = convTimePtr->INPLATCH;
    hwPtr->CTR[0].B.INPCMP = convTimePtr->INPCMP;
    hwPtr->CTR[0].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[1].B.INPLATCH = convTimePtr->INPLATCH;
    hwPtr->CTR[1].B.INPCMP = convTimePtr->INPCMP;
    hwPtr->CTR[1].B.INPSAMP = convTimePtr->INPSAMP;
    hwPtr->CTR[2].B.INPLATCH = convTimePtr->INPLATCH;
    hwPtr->CTR[2].B.INPCMP = convTimePtr->INPCMP;
    hwPtr->CTR[2].B.INPSAMP = convTimePtr->INPSAMP;
#endif
    /*lint -restore */
}

/**
 * Enables ADC conversion and interrupts for the channels in the bitmask.
 *
 * @param hwPtr Pointer to ADC hardware struct
 * @param groupChannelIdMaskPtr Pointer to bitmask for channels
 */
static void enableNormalConversionAndIntrpt(volatile struct ADC_tag *hwPtr, uint32 const *groupChannelIdMaskPtr)
{
#if defined(CFG_MPC5643L) || defined(CFG_SPC56XL70)
    /* Enable Normal conversion */
    hwPtr->NCMR0.R = groupChannelIdMaskPtr[0];

    /* Enable Channel Interrupt */
    hwPtr->CIMR0.R = groupChannelIdMaskPtr[0];
#elif defined(CFG_MPC5606S) || defined(CFG_MPC5645S)
    /* Enable Normal conversion */
    hwPtr->NCMR[1].R = groupChannelIdMaskPtr[1];

    /* Enable Channel Interrupt */
    hwPtr->CIMR[1].R = groupChannelIdMaskPtr[1];
#elif defined(CFG_MPC5744P)
    /* Enable Normal conversion */
    hwPtr->NCMR[0].R = groupChannelIdMaskPtr[0];

    /* Enable Channel Interrupt */
    hwPtr->CIMR[0].R = groupChannelIdMaskPtr[0];
#else
    /* Enable Normal conversion */
    hwPtr->NCMR[0].R = groupChannelIdMaskPtr[0];
    hwPtr->NCMR[1].R = groupChannelIdMaskPtr[1];
    hwPtr->NCMR[2].R = groupChannelIdMaskPtr[2];

    /* Enable Channel Interrupt */
    hwPtr->CIMR[0].R = groupChannelIdMaskPtr[0];
    hwPtr->CIMR[1].R = groupChannelIdMaskPtr[1];
    hwPtr->CIMR[2].R = groupChannelIdMaskPtr[2];
#endif
}

