z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/Adc_560x.c
#if defined(ADC_USES_DMA)
/**
 * Enables DMA
 *
 * @param hwPtr Pointer to ADC hardware struct.
 * @param groupChannelIdMaskPtr Pointer to bitmask for channels
 */
static void enableDMA(volatile struct ADC_tag *hwPtr, uint32 *groupChannelIdMaskPtr)
{
#if defined(CFG_MPC5643L) || defined(CFG_SPC56XL70)
    hwPtr->DMAE.R = 0x01;
    /* Enable DMA Transfer */
    hwPtr->DMAR0.R = groupChannelIdMask;
    Dma_StartChannel(DMA_ADC_GROUP0_RESULT_CHANNEL);        /* Enable EDMA channel for ADC */
#elif defined(CFG_MPC5606S)
    hwPtr->DMAE.R = 0x01;
    /* Enable DMA Transfer */
    hwPtr->DMAR[1].R = groupChannelIdMask;
    Dma_StartChannel(DMA_ADC_GROUP0_RESULT_CHANNEL);        /* Enable EDMA channel for ADC */
#elif defined(CFG_MPC5744P) || defined(CFG_MPC5777M)
    hwPtr->DMAE.R = 0x01;
    /* Enable DMA Transfer */
    hwPtr->DMAR[1].R = groupChannelIdMask;
    Dma_StartChannel(DMA_ADC_GROUP0_RESULT_CHANNEL);        /* Enable EDMA channel for ADC */
#endif
}
#endif

void Adc_StartGroupConversion (Adc_GroupType group)
{
    const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromGroupId(group);

    /* Run development error check. */
    if (E_OK == Adc_CheckStartGroupConversion (adcState, AdcConfigPtr, group))
    {
        /*lint -e{9033} -e{923} Addressing memory mapped register so cast from integer to pointer ok */
        volatile struct ADC_tag *hwPtr = GET_HW_CONTROLLER(AdcConfigPtr->hwConfigPtr->hwUnitId);

        const Adc_GroupDefType *groupPtr = &AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER];

        /* Disable trigger normal conversions for ADC0 */
        hwPtr->MCR.B.NSTART = 0;

        /* Set group state to BUSY. */
        groupPtr->status->groupStatus = ADC_BUSY;

        groupPtr->status->currSampleCount = 0;
        /* @req SWS_Adc_00431 */
        groupPtr->status->currResultBufPtr = groupPtr->status->resultBufferPtr; /* Set current result buffer */

#if defined(ADC_USES_DMA)
        Dma_ConfigureChannel ((Dma_TcdType *)groupPtr->groupDMAResults, groupPtr->dmaResultChannel);
        Dma_ConfigureDestinationAddress ((uint32_t)groupPtr->status->currResultBufPtr, groupPtr->dmaResultChannel);
#endif

            /* Set conversion mode. */
		hwPtr->MCR.B.MODE = groupPtr->conversionMode; /*lint !e641 !e632 Should be enum acording to Autosar */

        /* Enable Overwrite*/
        hwPtr->MCR.B.OWREN = 1;

        /* Set Conversion Time. */
        setConversionTime(hwPtr, &groupPtr->adcChannelConvTime);

        uint32 groupChannelIdMask[3] = {0,0,0};
        for(Adc_ChannelType i =0; i < groupPtr->numberOfChannels; i++)
        {
#if defined(CFG_MPC5668) || defined(CFG_MPC5777M)
            if(groupPtr->channelList[i] <= 31){
#else
            if(groupPtr->channelList[i] <= 15){
#endif
                groupChannelIdMask[0] |= (1UL << groupPtr->channelList[i]); /*lint !e632 uint32 = Adc_ChannelType = uint32 */
#if defined(CFG_MPC5606B)
            }else if((groupPtr->channelList[i] >= 32) && (groupPtr->channelList[i] <=59)){
#else
            }else if((groupPtr->channelList[i] >= 32) && (groupPtr->channelList[i] <=47)){
#endif
                groupChannelIdMask[1] |= (1UL << (groupPtr->channelList[i] - 32UL)); /*lint !e632 uint32 = Adc_ChannelType = uint32 */
            }else if((groupPtr->channelList[i] >= 64) && (groupPtr->channelList[i] <=95)){
                groupChannelIdMask[2] |= (1UL << (groupPtr->channelList[i] - 64UL)); /*lint !e632 uint32 = Adc_ChannelType = uint32 */
            }
            else{
                /* MISRA */
            }
        }

#if defined(ADC_USES_DMA)
        enableDMA(hwPtr, &groupChannelIdMask);
#endif
        /* Enable Normal conversion and channel interrupt */
        enableNormalConversionAndIntrpt(hwPtr, groupChannelIdMask);

        /* Clear interrupts */
        hwPtr->ISR_STATUS.B.ECH = 1;
        /* Enable ECH interrupt */
        hwPtr->IMR.B.MSKECH = 1;

        /* @req SWS_Adc_00061 */
        /* Trigger normal conversions for ADC0 */
        hwPtr->MCR.B.NSTART = 1;
    }
    else
    {
        /* Error have been set within Adc_CheckStartGroupConversion(). */
    }
    /* @req SWS_Adc_00156 */
}

void Adc_StopGroupConversion (Adc_GroupType group)
{
  const Adc_ConfigType *AdcConfigPtr = GetControllerConfigPtrFromGroupId(group);

  if (E_OK == Adc_CheckStopGroupConversion (adcState, AdcConfigPtr, group))
  {
    /*lint -e{9033} -e{923} Addressing memory mapped register so cast from integer to pointer ok */
	volatile struct ADC_tag *hwPtr = GET_HW_CONTROLLER(AdcConfigPtr->hwConfigPtr->hwUnitId);

	/* Disable trigger normal conversions for ADC0 */
	/*@req SWS_Adc_00385 */
	/*@req SWS_Adc_00386 */
	hwPtr->MCR.B.NSTART = 0;

	/* Set group state to IDLE. */
	/* @req SWS_Adc_00360 */
	AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER].status->groupStatus = ADC_IDLE;

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
	/* Disable group notification if enabled. */
    if(1 == AdcConfigPtr->groupConfigPtr[group%ADC_NOF_GROUP_PER_CONTROLLER].status->notifictionEnable){
        /* @req SWS_Adc_00155 */
    	Adc_DisableGroupNotification (group);
    }
#endif
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}
#endif  /* endof #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */


/* @req SWS_Adc_00100 */
/* @req SWS_Adc_00101 */
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
void Adc_EnableGroupNotification (Adc_GroupType group)
{
    /* @req SWS_Adc_00057 */
	Adc_EnableInternalGroupNotification(adcState, GetControllerConfigPtrFromGroupId(group), group);
}

void Adc_DisableGroupNotification (Adc_GroupType group)
{
    /* @req SWS_Adc_00058 */
	Adc_InternalDisableGroupNotification(adcState, GetControllerConfigPtrFromGroupId(group), group);
}
#endif

Adc_StatusType Adc_GetGroupStatus (Adc_GroupType group)
{
	return Adc_InternalGetGroupStatus(adcState, GetControllerConfigPtrFromGroupId(group), group);
}

#if (STD_ON == ADC_VERSION_INFO_API)
void Adc_GetVersionInfo(Std_VersionInfoType* versioninfo)
{
    Adc_InternalGetVersionInfo(versioninfo);
}
#endif
